[
{"rating": 5, "text": "I'm going to keep this brief since there isn't much to say that hasn't already been said. *clears throat*I think the reason I waited so long to read this series is because I just couldn't imagine myself enjoying reading about an eleven-year-old boy and his adventures at a school of wizardry. I thought it would be too juvenile for my taste. I was wrong, of course.I can honestly say that I loved every minute of this. It's a spectacular little romp with funny, courageous, and endearing characters tI'm going to keep this brief since there isn't much to say that hasn't already been said. *clears throat*I think the reason I waited so long to read this series is because I just couldn't imagine myself enjoying reading about an eleven-year-old boy and his adventures at a school of wizardry. I thought it would be too juvenile for my taste. I was wrong, of course.I can honestly say that I loved every minute of this. It's a spectacular little romp with funny, courageous, and endearing characters that you can't help but love.It has talking chess pieces, singing hats, a giant three-headed dog named Fluffy, a hilarious giant with a dragon fetish, a master wizard that's just a little bit crazy, mail carrier owls, goblins running a bank, unicorns, centaurs(!), trolls . . . and probably much more that I'm forgetting. And then there's the lead characters: Hermione, the young scholar who starts out prim and up-tight but soon becomes a true friend; Ron, the boy who has little money but who has an abundance of family and loyalty to his friends to make up for it; and then there's Harry, the boy who starts out sleeping in a closet and ends up being a hero. Harry is kind to those that deserve it, fearless when it counts the most, and wonderfully intelligent. What's not to love? In regards to the ending: (view spoiler)[I feel silly saying this about a middle grade novel, but I didn't suspect Quirrell a bit! If there were hints that he was the true culprit and not Snape, I obviously missed them. (hide spoiler)]FAVORITE QUOTE: \"But from that moment on, Hermione Granger became their friend. There are some things you can't share without ending up liking each other, and knocking out a twelve-foot mountain troll is one of them.\"Now, if you'll excuse me, I'm off to start Harry Potter and the Chamber of Secrets.*******************************************************My reviews of other titles in this series:Harry Potter and the Chamber of Secrets[I feel silly saying this about a middle grade novel, but I didn't suspect Quirrell a bit! If there were hints that he was the true culprit and not Snape, I obviously missed them. (hide spoiler)]"},
{"rating": 5, "text": ""},
{"rating": 1, "text": "This is a disgrace to all pure bloods. My head looked quite dashing on that strange professor's head.. If only I could have extended my stay. Harry Potter.. This is not over yet."},
{"rating": 5, "text": "Why the heck did I not read Harry Potter before now...its flipping magical (literally)!"},
{"rating": 5, "text": "Rereading for the 3rd time for the group read.Once upon a time, there was a 10th grader named Khanh who didn't get along with people very well. She wasn't an outcast in school, and all the bullying and teasing stopped with the commencement of high school, but she had always been a bookworm and has generally preferred the company of her own thoughts.Lunchtime had always been dedicated not to eating, but to sitting in the library, browsing through books.(Not to worry, she got her nutrition in 5thRereading for the 3rd time for the group read.Once upon a time, there was a 10th grader named Khanh who didn't get along with people very well. She wasn't an outcast in school, and all the bullying and teasing stopped with the commencement of high school, but she had always been a bookworm and has generally preferred the company of her own thoughts.Lunchtime had always been dedicated not to eating, but to sitting in the library, browsing through books.(Not to worry, she got her nutrition in 5th period in the form of a giant 6-inch M&M studded cookie and a package of Sour Patch Kids and/or a package of Reese's Pieces. Ah, the effortless metabolism of youth.)One day, there were shiny new books on her school library's \"New Releases\" shelf. Harry Potter, books 1 through 3. She had heard of the books before, of course, since they were a constant presence on the NYT bestsellers list, but she had always avoided them, thinking of them as children's novels.At the grand age of 14, surely she was too old for a little kid's fantasy novel. She had read the Outlander series earlier that year, after all. And it had sex in it. SEX! She didn't really quite understand everything in the book, but the point is, she had read them. Surely, at 14, Khanh was ready for more mature novels.And that did not include Harry Potter. Harry Potter is 11. Khanh is 14. There is a vast difference in their ages. Khanh was a teenager, dammit.But the Harry Potter books were new. Brand new. They were shiny, they had never been touched by another reader. And Khanh was tempted.She picked up the first book in the series: Harry Potter and the Sorcerer's Stone.The end.Or rather, the beginning."},
{"rating": 5, "text": "My original review was a comparison of sorts between Harry Potter and Twilight. However, this is stupid as the two are incomparable. Honestly, its not even worth discussing. Its not just that Twilight doesn't come close, it is the fact that Harry Potter transcends other similar works. Its peerless. To quote Samuel L. Jackson in Pulp Fiction: It \"ain't the same fuckin' ballpark, it ain't the same league, it ain't even the same fuckin' sport.\" There was a day when I thought I needed to defend HarrMy original review was a comparison of sorts between Harry Potter and Twilight. However, this is stupid as the two are incomparable. Honestly, its not even worth discussing. Its not just that Twilight doesn't come close, it is the fact that Harry Potter transcends other similar works. Its peerless. To quote Samuel L. Jackson in Pulp Fiction: It \"ain't the same fuckin' ballpark, it ain't the same league, it ain't even the same fuckin' sport.\" There was a day when I thought I needed to defend Harry Potter, in the midst of the now dead Twilight craze, and you can see that below in what was my original review. It is a testament to the power of this series, that while various other franchises (Twilight, Hunger Games) have surged into popularity and then faded, Harry Potter remains unwaveringly strong after nineteen years. It is clear readers hold just as much admiration for these books as they always have. Time has not dimmed that.I will, one day, write an essay about what these books mean to me. Eternal, this is the one that started it all. Original review (circa 2010) A note in regard to the on-going Potter vs Twilight debate: Go ahed, tell me Twilight is better. Tell me that James is scarier than Voldemort, That the Cullens are a better family than the Weasly's That Edward is cooler than Harry, and Bella is smarter than Hermione. Tell me that Stephenie Meyer is more talented than J.K. Rowling. Go ahead, I dare you. Those who think the topic of Harry Potter or Twilight is worth debating and arguing over, are utterly stupid. Quite frankly-this book is amazing. "},
{"rating": 5, "text": "Update September 2016: Currently rereading this series again! (I need to sort out my priorities.)I will never ever rate this lower than 5 stars. BEAUTIFUL. "},
{"rating": 5, "text": "There are no words to do this book justice. "},
{"rating": 5, "text": "Review for Illustrated EditionPerfect. Duh.  Re-Read in December 2014 for Harry Christmas To YouOH LORDY. Every time I read this book it brings back so many memories, and also gets me excited to read the rest of the series again as well because there is so much foreshadowing!! For example:-Sirius Black is casually mentioned in the first chapter-Mrs. Figg is talked about a bit, as she looks after Harry from time to time (or all the time, ayyyy?)-it always cracks me up when Hagrid says you'd haveReview for Illustrated EditionPerfect. Duh.  Re-Read in December 2014 for Harry Christmas To YouOH LORDY. Every time I read this book it brings back so many memories, and also gets me excited to read the rest of the series again as well because there is so much foreshadowing!! For example:-Sirius Black is casually mentioned in the first chapter-Mrs. Figg is talked about a bit, as she looks after Harry from time to time (or all the time, ayyyy?)-it always cracks me up when Hagrid says you'd have to be mad to try and rob Gringotts... Damn crazy kids.Also here was a line in Dumbledore's chocolate frog card bio that said AND I QUOTE, \"Professor Dumbledore enjoys chamber music and tenpin bowling.\" HAHAHAHA WHAT EVEN. NOW I'M IMAGINING HIM BOWLING DRAMATICALLY TO CHAMBER MUSIC.Rowling is the queen forever and always.Re-Read in July 2012GINNY'S FANGIRLING IN THIS BOOK IS JUST TOO GOOD.Also, the Dursleys aren't as bad as people think they are, because after all, they DID pick Harry up at the end of the year rather than just abandoning him. So THAT'S worth something.mmmm, this book smells so good. It's good to be back."},
{"rating": 5, "text": ""},
{"rating": 4, "text": "How can more than half of my Goodreads friends be wrong with this?I have to get this right. As of this writing, I have 98 Goodreads friends. 61 (62%) of them have read J. K. Rowling's Harry Potter and the Sorcerer's Stone. Out of those who read this, 39 (64%) rated this with 5 stars. 11 of them with 4 stars. All the others gave 3 or 2. Only 2 rated this with 1 star. One of them admitted not being able to finish it. She should not have rated it really since she did not read its entirety. (But sheHow can more than half of my Goodreads friends be wrong with this?I have to get this right. As of this writing, I have 98 Goodreads friends. 61 (62%) of them have read J. K. Rowling's Harry Potter and the Sorcerer's Stone. Out of those who read this, 39 (64%) rated this with 5 stars. 11 of them with 4 stars. All the others gave 3 or 2. Only 2 rated this with 1 star. One of them admitted not being able to finish it. She should not have rated it really since she did not read its entirety. (But she is my friend and it is her right, so why question?)When the book came out in 1998, I was not yet a bookworm so I brushed this aside. I read only those books that my brother told me to read. He was the bookworm but he would not be caught reading any book being pushed by media hype. However, when Warner Bros. released the film adaptation in 2001, my daughter was 6 years old and I thought that, since there was too much hype, the movie must be good and we would have a memorable time with our first ever father-daughter movie date. I was wrong. She not only got scared because of the darkness inside the movie house but she trembled with fear during the life-size human chess game, in that scene when Ron was sacrificed. We left the movie in that scene with my daughter crying and me cursing it: \n  I will never read Harry Potter\n.My daughter is now 15 going 16. She is not fond of movies and she still does not show interest on reading Harry Potter. However, I am now a bookworm and the other week, I was with my 4 Goodreads friends and 3 of them raved (two of them, again) about Harry Potter books. Oh well, first-time fathers can make mistakes about first movie date with their daughters, Book 1 is included in 500 Must Read Books and the book must be a quick read. So the following day, I bought my copy.After 13 years of the book's existence and me ignoring it, did I finally make a good decision of reading it? Are all of those 39 friends of mine in Goodreads wrong in giving this 5 stars? Most of them did not bother writing a review. Maybe those would be too long or maybe they read this when they were not in Goodreads yet. But I am in Goodreads already so I can make this review long.These are what some of them say: it was a great book i enjoyed reading it For an eloquent reviewer, she must have been too happy to express herself.  Such a great story and creative way of writing. I love Harry Potter.  Yes, I agree about the story being great and J. K. Rowling being creative.  I was secretly wishing I was studying in Hogwarts too! It was silly, but I was simply enraptured by Harry Potter. Honestly, I still am :) It was a great book. I enjoyed reading it Coming from one of my favorite reviewers in Goodreads. I do not share her wanting to be a sorcerer though.  Honestly, I don't know anybody who'd refuse to even entertain the thought of attending a school for wizards. Another one of my favorite reviewers. That seems to have nailed this. Young people wanting to be in Hogwarts and study sorcery. That should be it! The world seems to be a dreadful place that we would all like to have powers to turn our enemies into frogs, pigs, ride on a broomstick and get the Snitch and earn points (money) for our family!Oh well, the Bible says that sorcery is Satan's work. The book even used the word Transfiguration as a subject in the sorcery school. Blasphemy.Just kidding. This is a work of fiction and I am not too old to appreciate it. I was just kidding. To be frank, I tried hard not to like this. I thought that giving this a 1 or 2 will freak out my friends and somehow get votes from those who are, up to now, ignoring this book. I told you so! Why waste your time? . However, unless you are a grumpy old man/woman, there is nothing not to like about this book. I maybe too old for it but hey, talent is talent and J. K. Rowling has it!My 39 friends are indeed right!"},
{"rating": 3, "text": "On my list of reasons why my daughters are the bestest thing to ever happen to me, Number 14,577 is that they gave me, at 41 years old, the perfect excuse to revisit the Harry Potter series. When my oldest angel told me she wanted to start reading the Harry Potter books, I couldn’t have been happier. As I was collecting all seven volumes off the shelf to bring up to her room, I started feeling nostalgic for the whole Hogwarts gang, and I realized that I’d never done more than a perfunctory revieOn my list of reasons why my daughters are the bestest thing to ever happen to me, Number 14,577 is that they gave me, at 41 years old, the perfect excuse to revisit the Harry Potter series. When my oldest angel told me she wanted to start reading the Harry Potter books, I couldn’t have been happier. As I was collecting all seven volumes off the shelf to bring up to her room, I started feeling nostalgic for the whole Hogwarts gang, and I realized that I’d never done more than a perfunctory review of this first volume. I figured it was high time to rectify that oversight.Harry deserves it. However, with over a million ratings, and almost two reviews for every day I’ve been alive, I think I can dispense with any plot distillation or character profiles. It has all been eloquently said before. Therefore, I just want to briefly express what I see as the essential magic at the heart of the series, and why I think it has resonated so strongly with so many people. Here goes...Only rarely does a story come along that can so completely wrap you up in a warm blanket of contentment and good feelings. One that can hold at bay, even if only for precious moments, the nasty brutishness of what often passes for daily life. These stories do that. It’s an escape into a world of optimism, honor, and hope, where things always look hopeful and anything is possible. Who wouldn't want to hang around in a place like that, especially when it is decorated with sorting hats, kindly giants, magic wands and Quidditch.Granted...no aspect of the story is revolutionary, or even particularly noteworthy, from the standpoint of blazing new trails within the fantasy genre. It isn’t great literature, and nothing about its technical merits makes it befitting of even a fraction of its unprecedented success. Fine...acknowledged. And? So what!The virtue of this story is the postive feelings it conjures in its readers. Harry’s story is something that radiates acceptance, inclusion, and friendship. It invokes a sense of belonging. Inside these pages, you can find the impetus to see the better angels of humanity’s nature, and feel just a little better about the world around you.How is that not worthy of praise?As for Harry himself, he’s just a good kid. The quintessential everyman who makes good. A loving boy with a clear head on his shoulders and a caring heart that pumps affection for the world around him. He’s someone you can’t help but like. He’s not perfect. He makes mistakes, he’s occasionally short sighted, and I know many of us wish he would stick up for himself a little more. Maybe reduce his aunt and uncle to a pair of fatty stains on the carpet, or give Dudley an atomic wedgie until his skivvies scrape against his pancreas. But that’s not Harry. He’s a better person than that. That’s why we love him. Maybe all of the above is a bit much. Like I said, I was feeling nostalgic and maybe the gush got a tad away from me. Let’s just say that these stories are perfect comfort food and reading them will make you happy. I’ll certainly settle for that. As for the rating, I Initially only gave this first volume 3 stars, and I’m not going to change that now. As much as I love the series as a whole, I don’t think it reaches stratospheric heights until Harry Potter and the Goblet of Fire. Still, this is where it all began. As such, it should be read and savored knowing that it only gets better.3.0 stars. Highly Recommended. "},
{"rating": 0, "text": "Yes, I've been living under a rock."},
{"rating": 5, "text": "It's Always Great, Coming back Home..There's a reason us, the Fans, feel that we're connected, no matter where we from, different culture, ethics, ages..we're all like graduated from there....Hogwarts..we're even like in the same class, classmates, no matter which edition we read....Cause Harry Potter is not just a story..it's a Life..The Boy Who Saved Flourished the Book IndustryIt's really One of the most important novels in the modern history, Sorry, it's The Most Important ONE.This Review alIt's Always Great, Coming back Home..There's a reason us, the Fans, feel that we're connected, no matter where we from, different culture, ethics, ages..we're all like graduated from there....Hogwarts..we're even like in the same class, classmates, no matter which edition we read....Cause Harry Potter is not just a story..it's a Life..The Boy Who Saved Flourished the Book IndustryIt's really One of the most important novels in the modern history, Sorry, it's The Most Important ONE.This Review also for those who hate the series !Please bear with me..Without it,most of the Book stores and publishers may have the same fate of the Video stores Blockbuster LLC, which despite being super popular in the 90s, closed all the stores by 2013 ,shutting down forever.Yes, without this novel, and with the rapid change in technology, the ease of making e-books and reading it in PCs, Smartphones,Tablets ,etc, the publishing and trade of new paper books may decrease rapidly. It'd be limited for religious or some educating books, classic and small novels., even these kinds of books goes just electronic…. and the books be just like an old Video Tape.A Dystopia ,right? very gloomy idea to the world without This novel, The One.Well, in the case you think I'm exaggerate..Let's haveA Brief !!! History of Literature in the 90s------------------------------------------Well, let’s back to the early 90s , where TV is in every house,even in every room ,Video sets are there too, rental video stores everywhere and satellite receivers and cable channels growing fast, with many channels for kids and teenagers making them attached more and more into screens, not to mention Video Games, Game boy and Nintendo… Those from this new generation who read are “weirdos\" or \"nerds” to the rest of their peers.And for those “few who read” book stores mostly got for them just comics and graphic novels, which most of them created early this century.The classic novels they read just for schools and education, otherwise they merely know the movies that based on.The new novels that make a best seller are the ones which made ,or will be made, into movies for Julia Roberts, Tom Cruse or any of the 90s Hollywood celebrity , or the ones by Stephen King because ,of course, will be made into movies too.Even these novels didn't live up the selling numbers of Tolkien, Charles Dickens, Agatha Christie -what’s with the British authors and selling numbers :)?- also in Russia no more Dostoevsky and Tolstoy , no more Hugo in France.Also in Egypt no more like Naguib Mahfouz and the great authors of the 50s to 70s...No new big hit for novels, most of the selling books are those of Speculation about strange and mysterious things in the world or in religion,Dreams explications , cocking books or just celebrities rumors.While in US and UK it selling books mostly the self help books, or those which teach how to make Computers programs or even web sites -this brand new huge technology leap back then.No new novels to attract the new generation of kids and teenagers, just some few successful highlights like R.L.Stine’s Goosepumbs in 1992 which make a very good success, and translated in many countries including Egypt.And in Egypt there’s also a very successful project made by The Modern Arabic Institution for Publishing & Distribution which made “Pocket Novels” for youth , by brilliant Egyptian writers,who presented excellent variety of novels of many genres, Sci-Fi, Action Thriller, comics, Romance .etc.There’s also “Reading for All”,project by the first lady “Susan Mubarak” which printed a huge verity of important books and novels from all over the world in very cheap prices.But all these effort didn't attract “more and more” of new youth readers ,it just made more and more books for those few who already reads.The vast numbers of those who don’t just read will increase if there isn't a big new attractive reading experience to get them into reading, specially with the more channels, more movies.But the BIGGEST Obstacle for them to read came out in 1994and became a real phenomenon by 1995...it’s the Playstation , the giant Japanese gaming leap..Football, Crash , Pepsi man, and the comics heroes also have their games , so why reading Superman , Batman’s comics when you can play them....**************************************************************************************************So by 1996,with this growing leap in Gaming, as also the Computer 3D games getting even much improves, Books get replaced bit by bit by a gaming controls.So do you think it’s wise for publishers to publish a book for new writer?Of course not, it may even cover it’s publishing cost.So it was very normal when in this year, 1996, when Joanne, a 31 years old lady from England , handed the manuscript for her first novel to 12 publishing houses, all of them rejected it...A manuscript of over 200 pages of a novel, that she had hard times in her personal and professional life while writing it, and for children??? Seriously is there still any who still read? it’s 1996, the era of Playstation and Video Games.But then, the Modest “Bloomsbury“ agreed to publish it ,with 2 advises for her, first that she’d get a day job, since it’s a little chance of making money in children's books. - later she received a grant from the Scottish Arts Council to help her continuing writing.-But the significant advice was to change her pen name cause young boys might not want to read a book written by a woman..so with her name and her grandmother’s \"Kathleen\" come the 2 initial of her pen name…J . k . Rowling And in 26th June 1997 ,with 1,000 copies, 500 of which were distributed to libraries..come out in UK, to our world The Greatest Harry Potter and the Philosopher's Stone\nAnd Baam , everything happened so fast..Before the end of this year the novel awarded many important litural awards in the UK, an American important publisher , Scholastic , won the rights to publish the novel in US, with a huge check Rowling would never dreams of.Just with small change, The title changes from Philosopher's Stone to the Sorcerer's Stone , as the American publisher saw that Philosopher's may not be that attractive to young readers..And Thanks to Harry Potter ,now Every young readers know much more about Philosopher's Stone from their other reads.In 1998 Book 2 released in UK ,1999 in US, winning more literary prizes. Becoming a Top Selling books in UK, US and many other countries which start to publish the translation for the first book.\n  \nAnd on 8 July 1999, The First Breaking Record made when Book 3 sold 68.000 copies in just three days after its release in the United Kingdom..and more copies when it released late 1999 in US..With the fast growing popularity of Harry Potter among readers , more records had been broken both in UK and US.... The 3 books takeover the top spot in the charts of best selling books for weeks and months, and it was still the hardcover editions.This conquer made some literary magazines and newspapers separate the Harry Potter books selling records from the rest of the top selling books, splitting its lists into children Books and adult books sections under pressure from other publishers who were eager to see their books given higher ranking. And then it was year 2000 , where everything is about to change .... forever..The Playstation 2 is out there, and even higher leap in Computer Games..But even with this much of temptations, thousands of children, teens and parents gathered in the midnight of 8 July 2000 in UK and US at the same day in front of stores, not electronic stores or Apple stores -as theses days- , it was Bookstores, for may be the first time in the Book Stores History , to buy a copy of ... Harry Potter and the Goblet of FireAnd They didn't mind to find out that the book is over 700 page, it was even for their pleasure, more than double the size of any of the first 3 novels..double the thriller, double the fun..Over 3 million copies sold at that day only in the US , a new world record...a totally unexpected one.huge story, bigger plot , mysterious and very well written. more literate prizes for Rowling... more translated editions to more than 40 language. And huge budget for the upcoming first movie of the series, which beautifully visualize the magic of the novel by the faithful producers and the director...and it also made some records , but that's not our subject now. ************************************************************************************By the announcement of pushing the publishing date of book 5 to mid 2003 , and even by 2 movies out so far, the hunger for reading Harry Potter kept on.. Also , as more readers start to increase into this generation, Publishers and book stores start to promote for more books for those readers who are hungry for more..Older fantasy books , like Lord of the Rings -which was a super successful movie by then too- Narnia , Golden Compass and many other novels which finally getting more reprinted editions...and so Book stores to get more and more readers.More countries welcomed the Harry Potter phenomenon.. The English edition AND the local translated ones ,both been sold everywhere worldwide. Even in Egypt English edition sold at many books stores and,hopefully some new book stores specialized in English novels start to open in Cairo and Alexandria by 2002-2003..and finally in summer 2002, Nahdet Masr for publishing and distribution got the rights and published the Arabic edition, although it cut some of the lines for the length issues, fearing it may won't attract more readers , but the edition still hold the magic of it..making a very good sales.****************The good news is,the literary movement didn't stop there, more new books come out for the increasing demand from the readers..Life of Pi , the 2002 man Booker winner make very good sales numbers by.And in April 2003 Dan Brown (previously published 3 novels, making good sales) released a novel that made huge fuss around and making a new sales records , The Da Vinci Code.. The funny thing that there's a reference in this novel that Harry Potter is the second most selling book in history after the Bible..., a speculation that happens to be true in less than 5 years after that. A month later,May 2003, Khaled Hosseini released his first novel -do you think publishers would agree if there's no Harry Potter before? ,He'd may be rejected by 12 publishers like you know who :)- , The Kate Runner which also made a very good records too.And that's didn't affect the main reason for this new 'literal renaissance'.All that didn't affect the Records Breaker to break records one month later..On 20 June 2003 book 5 'Harry Potter and the Order of the Phoenix' comes out , ten thousands of all ages conquer the book stores in UK, US and other countries too to get the one they been waiting for at least 2 years... shipping agents like FedEx made the delivery to many countries to get the book at the same time.A New world Record ,5 millions copy at the first day only..For the first time in France a non french language book placed in no.1 of the bestselling book....Some kids got a headache called 'Harry Potter Headache' as they read the whole 850 pages of the book five, the biggest so far, at the same day without resting.And in Egypt, in September the same year, the Arabic edition of book three comes out with unexpected sales records, first edition run out of the stores by the first week only although it's nearly the beginning of the School year, and the movie of this 3rd book still filming. ِAnd the price of the book get higher 20% in 2 days and still with increasing demand..More English books and novels sold in Egypt too, along with the Arabic ones, publishing more books for new Egyptian writers along with more of the famous ones , Alaa El Aswany's first novel 'Yaqubean's Building' makes very good selling numbers..\n  \n2004 the Arabic edition of Book Four makes a price war between book stores and magazines stands.January 2005 , an abridged translated edition of Book Five make many readers angry in Egypt , specially that many already read the English edition before, so the publisher release an unabridged one by May.And in the same year's summer, on 21 July, A higher record that breaks all the previously ones\n  \n 6.9 million copy of book 6 sold in US in its first day... A huge book, may didn't fans' expectations of being full of action , but it get a twist that blow minds about one of the most interesting characters, Professor Snape.That made many fans and even big authors like Stephen King and Salman Rushdie talk about for months..****************The pre-final book followed by a massive variety of new novels, new authors....Twilight series, Percy Jackson series, and more new novels, more books sales not only in US, UK but worldwide...But still Potter is the Records Big Breaker... At the midnight before 21 June 2007, everywhere around the globe the scene of thousands of people lining in front of book stores was repeated...even bigger than any time before.. A huge record for pre-orders online reach to one million copies by Amazon, and total sales of 11 millions copies in UK and US in the first day only.The book sold at the same day almost in every country,even in Israel which made a big religious fuss about the book stores being open in their holy Saturday, But it's Harry Potter after all, the world's most unusual, unexpected phenomenon and sales records breaker.And that's not bad, it was the Miracle of bringing back readers to book stores, thousands of topics went online asking 'what to read next'....Indeed, although there's the ebooks, ereaders , etc , still there's thousands of new books and novels published and sold every year , in every where in the world.The gaming devices is increasing yes, not as expected though by the 90s and early 2000s \"remember Nokia N-Gage\"- but so do the reading devices which first come out by Sony in 2004,make big step by Amazon's Kindle in 2007...the ebook applications on every device.New books and series come after that , and still on, making super sales, attracting more readers... more writers come with more books and novels, some are just a rip off others and some are really original and brilliant. in UK, US , Egypt ..ever where all over the globe..No matter a Playstation 4 is out, or new xbox, the books still there...with its most beloved magic..The magic of books is back and , I believe, to stay..Don't you see with me that the magic of Harry Potter is one of the main factors of this magic?\n  “This boy will be famous. There won’t be a child in our world who doesn’t know his name”\n  \nThat's what Rowling wrote at the very early pages of her first book..The one that rejected by 12 Publishing Houses in 1996...Well, what about now?God, Talked too much in the \"Brief\" introduction , didn't I?Well, that's it for this review... I guess some still think it's just the Propaganda that made that all....Well I'll try to prove them worng by the upcoming next 6 reviews at the other 6 Books of the series..Links will be here as soon as it'd done .. وللمقالات العربية ايضا Now I'll be back to go around Hogwarts.....For the Zillionth time I guess..Hope to see you there too, come on and try first year :)From HogwartsMohammed ArabeyThe Craziest Potterhead of EgyptRe-reading the new edition -Guess I'm addicted to new editions BUT this one really rocks..\"Bloomsbury-2014\"from 12 Sep. 2014till 23 Sep. 2014"},
{"rating": 5, "text": "Here are three reasons why Harry Potter rocks my socks:1.A Better WorldOne of the main reasons Harry Potter is so wonderful is because Rowling shows you a boring world; it is the world of reality, dry, boring and ordinary. Then under it she reveals fantasy; she reveals everything a reader longs for: she reveals pure escapism. I still want to go to Hogwarts. I always will. 2. We’re all a bit like HarryOkay so not many of us are orphans, and not many of us are practically abused in their own homesHere are three reasons why Harry Potter rocks my socks:1.A Better WorldOne of the main reasons Harry Potter is so wonderful is because Rowling shows you a boring world; it is the world of reality, dry, boring and ordinary. Then under it she reveals fantasy; she reveals everything a reader longs for: she reveals pure escapism. I still want to go to Hogwarts. I always will. 2. We’re all a bit like HarryOkay so not many of us are orphans, and not many of us are practically abused in their own homes, but a lot of us feel isolated in the world, a lot of us wish for a fantastic group of friends as a child. I know I did, and this again leads back to my first point. Not everyone finds a Ron and Hermione.3. The magicSeems a bit of an obvious point doesn’t it? But, seriously, not many books have such a well-developed system. We have different categories, spell names, potions and books, lots of books on magic. And who doesn’t like books on magic? "},
{"rating": 5, "text": " This boy will be famous. There won't be a child in our world who doesn't know his name. Everyone grew up with Harry Potter. They read all the books when they were young and watched all the films. They would re-watch and re-read them. They would fall in love with the Wizarding World and would completely adore Harry, Ron, and Hermione. They would talk about them non stop, about Hogwarts, about its teachings, about them wanting to become students there and pretending they are, about joining the HP\n  ❝This boy will be famous. There won't be a child in our world who doesn't know his name.❞\nEveryone grew up with Harry Potter. They read all the books when they were young and watched all the films. They would re-watch and re-read them. They would fall in love with the Wizarding World and would completely adore Harry, Ron, and Hermione. They would talk about them non stop, about Hogwarts, about its teachings, about them wanting to become students there and pretending they are, about joining the HP fandom, about loving every character and instantly missing the world. Everyone would adore Harry Potter and knew about it since they were young ones.Except me. I didn't grow up with Harry Potter. Not because I didn't get to, but because I chose not to. I know, it's like living a life where everything has been a lie. Worse even. It's just, the movies would appear on my tv. From the first one, to the next and the next, and every time I saw the trailer for the upcoming one, I wouldn't be interested and would skip it when I came to it. I wouldn't bother and wouldn't care, and that made a big problem in my life now. Here I am now, being left out because of such poor choices and decisions I made when I was 7, 8, 9, and older until now. But now, as 2016 and having over 500 friends that are caught up and have read the recently published novel, Harry Potter and the Cursed Child, I have finally read the first book and am able to continue the series and watch the films. Now, here I am, wishing to go back to my past and change this nightmare and actually watch the films or read the books because I have literally missed on so much, missed too much, and have been missing too much. I have been out of this world and never realized how good it is, and how special it already has become.\n  There is no good and evil, there is only power, and those too weak to seek it.\nI find it stupid of me to write a review for Harry Potter, especially being the first one. I also find it stupid of me how I just recently decided to check this out and finally read it. But still, I guess I can still write a review. Of course, my thoughts would be quite similar to everyone else. Thoughts and opinions, nothing negative, maybe, maybe not. But, here goes nothing.Harry Potter is one of the most famous, loved, and top series out there. It is loved, adored, cherished, and amazing for HP fans every time they read it. No matter how many times it is read, it fills the person's heart with warmth and happiness, as they are going back to the wizarding world. As for me, I have finally entered it and feel young and new and early to this, because I am new to this all.Other than that, Harry Potter is considered a Children's book but in my opinion, it's in between middle grade and young adult because it can be hard to read for some. Although it was very very easy for me to read and understand, I see myself reading this all these years before and having a lot of trouble pronouncing some names. Harry Potter, a story about a young wizard that didn't even know he was a wizard. Harry Potter, a 10 year-old boy, who turned 11, is living with his horrible, rude and awful \"family\", The Dursleys. Mrs. Dursley is known as Harry Potter's mother's sister. The problem is, they didn't like each other, nor blend in with each other. They were different. Her sister was a witch, while she was just a Muggle, a person who cannot seek the magic and find it, nothing and no one special because they aren't able to turn things into other things, aren't able to fly on a broom, cast a robe on fire, defeat a villain, confuse a troll, aren't able to do anything, really. Well, she wasn't, besides treat Harry with such disrespect and treat her ugly and fat son with such caress and would spoil him because he was such a little brat that would get what he wants. Really though. There would be 36 presents under a Christmas tree and as he counts them, he pouts and is upset because it's less than what he had the year before. DUDE I BARELY GET A BARNES AND NOBLE GIFT CARD CHILL!The reason for Harry living with this family and having to go trough all this trouble and mess, is because he was actually given to them by Professor Albus Dumbledore, known as one of the greatest wizards and the headmaster of Hogwarts School of Witchcraft and Wizardry. When Harry was a baby, his parents were killed by Everyone-Knows-Who but as he tried killing Harry, he really wasn't able to. His mother was killed because she was trying to stop him, but as he tried killing Harry, he couldn't bare to do it and left him a scar, the scar that has made Harry known and popular for surviving this evil person. Once saved and taken, the only people they can rely on are The Dursleys, and as Harry grows, they expect them to tell him he is a wizard and tell him everything and fix all the lies. Except they don't.As days pass, Harry has been getting letters from someone he doesn't know. He doesn't know who it is and what they want, but he knows there is something going on, due to the amount of letters being sent. After getting the chance to open the first one, his Uncle Vernon decides to snatch it away from him, read it, and burn it. He knows, he knows who it is and what they want, but he doesn't want Harry to know. But even with him burning letter by letter and collecting them all, letters keep arriving and arriving, until the person finally shows up face-to-face with The Dursleys and Harry on his 11th birthday.He's huge, introduced as a half-giant and half-human, known as Rubeus Hagrid. Hagrid is the one who tells Harry the truth, telling him he is a wizard, and a well-known one as well. He's got talent, and has some of the same abilities as his parents. One being a witch and the other being a wizard, Harry is known as a wizard as well. And as Hagrid tells him the truth, Harry does too. He doesn't know what he is talking about and doesn't know what is going on. He doesn't believe he is a wizard, and doesn't believe the reason for his parent's deaths. But of course, Hagrid decides to tell him the truth and tell him his parents did not die on a car crash, for that seemed impossible, but they were killed by Everyone-Knows-Who and is the reason for his scar.His aunt, finally admitting herself into being a witness of knowing the truth, got everything out of her chest and was able to tell him the truth. She wouldn't even mention her sister, because she pretended to not have one. She was considered perfect and brave, while she was nothing and unnoticed. Nothing has changed, but she didn't even bother trying to care care of her niece as her sister is dead, protecting Harry from wherever she is. And as Hagrid tells Harry the rest, he actually takes Harry with him even when Mr. Dursley \"forbids him.\" He can't do anything, since he is a Muggle and Harry has already been accepted to Hogwarts School and nothing can change. When Harry leaves with Hagrid, they go and buy him what he needs, including clothes and supplies for the school. As they go to the shop, he is introduced as Harry himself but is instantly known by everyone else. Everyone is pleased to meet him and feel proud because they have shaken his hand. He's famous, his name is everywhere, and he can be considered a legend for what happened. But even with all this going on, Harry is still a little confused and figuring things out. As Harry and Hagrid get what they need, it's time for Harry to go to school, where he meets Ron Weasley, as to what I know, one of his best friends. Ron is small, red-haired, has freckles, pale, and has two twin brothers going to Hogwarts with him. He's not accepted into the other groups, and that is why he blends in with Harry and becomes his friend. Harry also meets Hermione Granger, known as someone annoying and as a nightmare to them both because of how bossy and unrealistic she can be. Of course, they are all so small and Hermione is a little nerd that enjoys every teaching at this school, so I was just like \"we get it.\" Days pass, and Harry is being trained. He's a neutral to broom-stick flying, is able to play Quidditch, the most popular game in Hogwarts, is given special supplies, and is of course, known by everyone. Other than that, Harry suspects his own secrets and wants to find out truths, but in order to do that, he must find a way to find them and figure them out. With the help of his two friends, he might just be able to figure out the real reason behind him being a wizard, more about his parents, history about himself, who this \"You-Know-Who\" person is, remember his past, and see how his life really will be changed, forever.\n  Humans do have a knack of choosing precisely those things that are worst for them.\nHarry Potter was easy to read, understand, and there was no hesitation when it came to rating it 5 stars. Now, I hate myself once again and ask myself, again, \"Why the fuck did I not read this earlier?\" The answer is obvious, because I already know it and it's because I was never a fan of it. I hate speaking about my past, but this is one ugly past and I hate it. I hate the choice I made and I hate myself for allowing it. But soon I'll get over it and will be able to re-read this as many times as I will be able to during my last 3 years of being a teen. Yes, a 15 year-old that has not read Harry Potter simply because she chose not to when she was able to and when she was young. PATHETIC.The fantasy is cute, I will say. It's easy to understand and the book is easy to fly through. It's not long, it's not hard, and it's not boring. It's gripping, fun, and everything is filled with some kind of magical element that has me turning page by page. Having no regrets anywhere, I am finally able to talk about HP and the world of wizards, where students learn how to make potions, talk to ghosts, learn about other creatures, transform things into other things, read minds, become invisible, fly in the air with a broomstick, play soccer in the air, have a feast and enjoy it all, learn magic, have a wand, and just be filled with happiness because of the friends and families considered in the houses. Well, I guess in most.Everything was fun to read. I laughed at some parts and found the story to be more affective to me as Harry was figuring out his new and changed life. He was confused, but he found out a lot more. There's still more, but I know that as he grows, I will be able to follow along the late ass journey and see where he grows to and how. I'll see how strong he gets and find out some strengths and weakness'. I'll be able to join an invisible magic carpet and fly through the series because I just want to know what happens next and how everything goes. I want to see Harry become a better person and be able to prove Draco and his stupid friends wrong about what they think. I want his friendship with Ron to grow and become stronger. I want Hermione to stop being so talkative and take a little break of being so bossy. But more importantly, I want to have a fun journey reading this and feeling like I'm on an adventure. Reading it for the first time feels like one. I've never watched the films. I've watched parts, but skipped them. Now, I won't skip anything. It's like an adventure where I'm dived in and can't seem to leave because I'm so alive and intrigued.What can I say about Harry Potter that others have not said? Nothing. Reviews are always similar, and this one might be too. Everyone loves it, and so did I. So will I, I should say. , Yes, I had trouble pronouncing some names at first but got used to it after. Yes, I rolled my eyes at times because there were moments where I was annoyed. But nothing was boring, and even when I rolled my eyes, there was a reason for that eye rolling scene. Maybe it was Hermione being annoying, or Draco being a rude boy, mocking an adorable red-haired. Or both. But I was also laughing. I would always laugh when it came to Hagrid. Since the beginning, I instantly loved him and considered him hilarious. I love how he turned Dunley into a pig but failed because he was already too much of a pig. I remember laughing and noticing my parents looked at me weirdly, but that's okay because I needed a novel where I was happy and ended up laughing at times. Oh and also, Hagrid is honestly so nice and adorable guys, I love him. He's so funny and protective and is such a good friend to Harry. I loved everything he did for him and was glad he was the first one to introduce himself to Harry. He cared for him since he was a baby and saw him as 11, bring him a present and giving him another one at the end. Ron is honestly the cutest. I don't understand how anyone could be mean to him. He may be weak, but he has his own strengths. He's so adorable and small and I hated how Draco treated him. There were some times unnecessary and I hated Draco for it, but I'll probably end up loving Draco some time throughout the series and probably regret it because I know he's still gonna be really mean throughout the series. I'm sure. I haven't spoiled myself, so I have no idea how his or anyone else's life goes, but I do know that he changes in some way. Hermione is a small and cute nerd as well, but sometimes I hated how sassy she was and bossy. She hated losing points for her house and because she, Ron, and Harry were in the same house, they had to work together and find a way to become friends to find out other truths and earn points for Gryffindor. She took everything very serious and showed off at times because of her perfect test grades and assignments, but I was glad she was able to put up with Ron and Harry while they put up with her.Malfoy Draco was someone I did not like, at all. Like I said, he mocked and made fun of Ron and I hated him for it. He showed off as well but in the bad way, thinking he was really cool just because he's in Slytherin and how used to the wizarding world he is. He didn't show much care about Harry and his past, and would try to get in a fight with Harry while Harry tried fixing the problem. He payed no attention and took it too far with Harry. He was a newbie as well, so I don't see what the point was. But the other point is that I don't have expectations for Draco but I hope I don't end up hating him in all books and hope there is some change, at least slightly good.The friendship between Harry, Ron and Hermione was probably one of my favorites. I know it didn't work out at first and they honestly hated her, but I was so happy it literally had to work toward the middle. Thanks to the troll, she became their friend and actually was able to cooperate with them. She didn't yell at them for fighting the troll, but instead told them to be careful and send word if anything goes wrong when Harry went for the mirror again. As it was ending, she was saying goodbye to Harry and Ron and was even awkward because she couldn't really figure out what to say. But also, my heart was really happy when she hugged Harry because it felt real and it felt like something I had been waiting since the beginning. It was friendship goals as they were becoming friends, and it just made me happy seeing them all together, same house, same team, same classes. The writing of course is, like I said, easy to understand. There were no words that were confusing in any way or words that got me mixed up because of how similar they sounded, and there were no problems. I didn't know what was gonna happen next and I know books are always better than movies, but I will watch the films after or after finishing one book just to see the differences. I hear they are kind of the same, just that the book provides some more information and detail. Like always, it's no surprise. \n  There are some things you can't share without ending up liking each other, and knocking out a twelve-foot mountain troll is one of them.\nOverall, I am so proud of myself for getting the first book over with, now wanting the 2nd and the 3rd and the rest. Really excited to see where this all goes to, and how Harry becomes a better wizard."},
{"rating": 5, "text": "As wonderful and magical as promised. Because I didn't remember the movie, the third act of the book was a delightful surprise to me.I wish I'd had this book when I was a kid, because the idea that someone could be special without knowing it, and then get to visit a special world where the things that made him different were the same things that made him awesome would have been really inspiring to me.Anne's finishing this, too, and I have to wait for her before I start in on the second book ...As wonderful and magical as promised. Because I didn't remember the movie, the third act of the book was a delightful surprise to me.I wish I'd had this book when I was a kid, because the idea that someone could be special without knowing it, and then get to visit a special world where the things that made him different were the same things that made him awesome would have been really inspiring to me.Anne's finishing this, too, and I have to wait for her before I start in on the second book ... HURRY UP ANNE!"},
{"rating": 3, "text": "Current project: re-reading HP. My history: I was a young adult when this first book came out, and the print book never really grabbed me when I gave it a try. I found that I very much enjoyed the American audiobooks with Jim Dale narrating, however, so I read the first few books this way. But this came to an end when I misplaced the fourth book and no longer had a long commute--I never did reach the end of that wretchedly long quidditch game, so I gave up. But here it is, 2015 and I'm trying agCurrent project: re-reading HP. My history: I was a young adult when this first book came out, and the print book never really grabbed me when I gave it a try. I found that I very much enjoyed the American audiobooks with Jim Dale narrating, however, so I read the first few books this way. But this came to an end when I misplaced the fourth book and no longer had a long commute--I never did reach the end of that wretchedly long quidditch game, so I gave up. But here it is, 2015 and I'm trying again! This time I'm doing the wonderful Stephen Fry narration on audio. It's interesting to come into these books after all this history, both in the sense of the cultural impact of these stories as well as the knowledge of how much children's lit, as art and as industry, has changed for the better because of them. Re-read reaction: 3.5 starsWith this first book (and I suspect with the next few), I still feel the way I did before. I admire the incredibly imaginative ideas so much, but the writing isn't quite as rich or the character development isn't quite as deep/emotional as I'd like just yet. It's a pretty straightforward story, albeit one embellished with fantastic details. But I LOVE HERMIONE GRANGER, always have, and I've heard the later books are much darker. And it's still a lovely experience to have the books read to me like a bedtime story. My favorite parts of this book: The mirror of Erised, owl post (pleeease may I have an owl), and the thing hidden under the turban. And:\n  It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.\nWell done, Neville. You deserved the same number of house points as the other children, in my book. "},
{"rating": 5, "text": "This doesn't really need a review, does it?This series is brilliant and it will live on forever in our hearts and minds."},
{"rating": 1, "text": "Can 35 Million Book Buyers Be Wrong? Yes.Taking arms against Harry Potter, at this moment, is to emulate Hamlet taking arms against a sea of troubles. By opposing the sea, you won't end it. The Harry Potter epiphenomenon will go on, doubtless for some time, as J. R. R. Tolkien did, and then wane.The official newspaper of our dominant counter-culture, The New York Times, has been startled by the Potter books into establishing a new policy for its not very literate book review. Rather than crowd oCan 35 Million Book Buyers Be Wrong? Yes.Taking arms against Harry Potter, at this moment, is to emulate Hamlet taking arms against a sea of troubles. By opposing the sea, you won't end it. The Harry Potter epiphenomenon will go on, doubtless for some time, as J. R. R. Tolkien did, and then wane.The official newspaper of our dominant counter-culture, The New York Times, has been startled by the Potter books into establishing a new policy for its not very literate book review. Rather than crowd out the Grishams, Clancys, Crichtons, Kings, and other vastly popular prose fictions on its fiction bestseller list, the Potter volumes will now lead a separate children's list. J. K. Rowling, the chronicler of Harry Potter, thus has an unusual distinction: She has changed the policy of the policy-maker.Imaginative VisionI read new children's literature, when I can find some of any value, but had not tried Rowling until now. I have just concluded the 300 pages of the first book in the series, \"Harry Potter and the Sorcerer's Stone,\" purportedly the best of the lot. Though the book is not well written, that is not in itself a crucial liability. It is much better to see the movie, \"The Wizard of Oz,\" than to read the book upon which it was based, but even the book possessed an authentic imaginative vision. \"Harry Potter and the Sorcerer's Stone\" does not, so that one needs to look elsewhere for the book's (and its sequels') remarkable success. Such speculation should follow an account of how and why Harry Potter asks to be read.The ultimate model for Harry Potter is \"Tom Brown's School Days\" by Thomas Hughes, published in 1857. The book depicts the Rugby School presided over by the formidable Thomas Arnold, remembered now primarily as the father of Matthew Arnold, the Victorian critic-poet. But Hughes' book, still quite readable, was realism, not fantasy. Rowling has taken \"Tom Brown's School Days\" and re-seen it in the magical mirror of Tolkein. The resultant blend of a schoolboy ethos with a liberation from the constraints of reality-testing may read oddly to me, but is exactly what millions of children and their parents desire and welcome at this time.In what follows, I may at times indicate some of the inadequacies of \"Harry Potter.\" But I will keep in mind that a host are reading it who simply will not read superior fare, such as Kenneth Grahame's \"The Wind in the Willows\" or the \"Alice\" books of Lewis Carroll. Is it better that they read Rowling than not read at all? Will they advance from Rowling to more difficult pleasures?Rowling presents two Englands, mundane and magical, divided not by social classes, but by the distinction between the \"perfectly normal\" (mean and selfish) and the adherents of sorcery. The sorcerers indeed seem as middle-class as the Muggles, the name the witches and wizards give to the common sort, since those addicted to magic send their sons and daughters off to Hogwarts, a Rugby school where only witchcraft and wizardry are taught. Hogwarts is presided over by Albus Dumbeldore as Headmaster, he being Rowling's version of Tolkein's Gandalf. The young future sorcerers are just like any other budding Britons, only more so, sports and food being primary preoccupations. (Sex barely enters into Rowling's cosmos, at least in the first volume.)----------------------------The first half of a little piece I wrote from the Journal in July 2000. Rest is available at [http://wrt-brooke.syr.edu/courses/205...]."},
{"rating": 5, "text": "Reviewed by: Rabid ReadsI wasn't going to review this for Rabid Reads, but then I was reminded of the multitudes of unfortunates who haven't read HARRY POTTER yet . . . I ask myself:Me: How can this be?Self: *shrugs awkwardly*Me: The HARRY POTTER books breathed new life into readers of all ages. They're amazing, wonderful, fantastic, addicting, SUPERLATIVE--Self:  *nods emphatic agreement*So what's the deal people?Boiled down to its most basic elements, HARRY POTTER AND THE SORCERER'S STONE is uReviewed by: Rabid ReadsI wasn't going to review this for Rabid Reads, but then I was reminded of the multitudes of unfortunates who haven't read HARRY POTTER yet . . . I ask myself:Me: How can this be?Self: *shrugs awkwardly*Me: The HARRY POTTER books breathed new life into readers of all ages. They're amazing, wonderful, fantastic, addicting, SUPERLATIVE--Self:  *nods emphatic agreement*So what's the deal people?Boiled down to its most basic elements, HARRY POTTER AND THE SORCERER'S STONE is urban fantasy. For kids? Absolutely.For adults? ALSO absolutely.Rowling creates a wondrous world of magic that exists alongside the normal, the \"muggle\" world.In this magic world, the objects and PEOPLE in pictures move, chess pieces are both sentient and opinionated about your game-playing strategy. Jelly beans come in EVERY flavor, so part of the fun is never knowing whether the funny yellow one is going to be toffee . . . or earwax. Creatures of legend--centaurs, hippogriffs, dragons, goblins, etc.--are part of everyday life. If you're a wizard.But all of the world-building is secondary to Harry himself. The boy who lived.Harry was only a year old when he was given over to his only living relatives. The Dursleys of 4 Privot Drive are happy in their normalcy, their mediocrity. They think things properly account for the worth of a person, they indulge their already horrible son, and they more than neglect Harry . . . They're dismissive of him. They humiliate him. They stifle him. And they do all of these things thoughtlessly. As if he's not a real person . . . B/c he's other..Their abuse is so offhand, you have to be an adult, or least a mature reader to recognize it for what it is. Younger readers just see a hateful villain. A hateful villain who does such ostentatiously self-centered things to poor Harry that they can alternately \"Yayyyyyy,\" and \"Booooooo,\" with enthusiasm. I've heard similar comparisons made about Robin Williams' Genie in Disney's \n  Aladdin\n--the character was complex enough for adults to enjoy while being thoroughly entertaining to children.So that's my sale. Harry Potter isn't just for children, it's for EVERYONE. In my humble opinion, what Rowling has done with these books makes Disney's Genie look like amateur hour (and I quite like Aladdin. FYI).And as the recent popularity of coloring books for adults has proven, people of all ages like pretty things, and that is why this new illustrated version is spectacular:SO. We have an engaging premise: a child mysteriously defeats the most powerful dark wizard in memory, becoming instantly famous in one world, a world full of wonder and magic, is raised ignorant of his past by negligent relatives, only to be reintroduced to the magical world when he comes of age to attend the equivalent of middle school.We have the earlier referenced fantastical world-building. We have well-developed, often hilarious or reprehensible characters (depending on whether they're meant to be Good or Bad). And we have addictive individual story plots that build into the best Good vs. Evil story arc since LOTR. And children LOVE it. So will you. More than highly recommended. 1/2/16: Getting starting one day late on the HARRY POTTER BR over at \n  BB&B\n. *shrugs* Harry Potter is good today, yesterday, and tomorrow. My other reviews for this series:\n  Harry Potter and the Chamber of Secrets (Harry Potter #2)\n"},
{"rating": 5, "text": "This? This is everything.I wouldn't even be on here if I hadn't decided to randomly buy \"that book with the cool-looking cover\" all those long, long years ago— and for that, I thank you deeply and eternally, Miss Rowling."},
{"rating": 5, "text": "Beyond amazing! Way to start the new year! :)I've read Harry Potter and the Sorcerer's Stone way back in High School but I wasn't able to finish it because sad to say, my book was lost. :( And now, thanks to my lovely friend Allie who gave me a copy of this book, I became interested to read it once again and bring back the old times' feels. And WOW! Just WOW! Thank goodness I decided to read it again because it felt so magical and magnificent and totally breathtaking! -- exactly what I've felt tBeyond amazing! Way to start the new year! :)I've read Harry Potter and the Sorcerer's Stone way back in High School but I wasn't able to finish it because sad to say, my book was lost. :( And now, thanks to my lovely friend Allie who gave me a copy of this book, I became interested to read it once again and bring back the old times' feels. And WOW! Just WOW! Thank goodness I decided to read it again because it felt so magical and magnificent and totally breathtaking! -- exactly what I've felt the first time I've read this.Harry Potter is such a great, well-fleshed out character. Despite being parentless and being bullied both in the Muggle world and Hogwarts by some kids, he still stood up and even became a great friend to Ron, Hermione, Neville, and the others. This story had lots of exciting adventures and I really enjoyed everything that happened in this book. It was just so awesome! The secondary characters are also perfect. I especially love Hermione and her genius mind! Ron's loyalty towards Harry is also awe-inspiring, as well as Neville's adorable clumsiness. When it comes to its plotline, it's amazingly done. The twist was unpredictable and there was humor in every page that made me laugh. What's even great are the lessons and the message that are instilled to every reader, fantasy and magic aside.\n  \n    \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.\"\n  \nI loved all the chapters and my favorites are:The Boy Who Lived, The Vanishing Glass, Diagon Alley, The Journey from Platform Nine and Three-Quarters, The Sorting Hat, and Quidditch.No wonder why this book and the whole series continues to be a real sensation. J.K. Rowling is so brilliant she bewitched me with her world! So excited to find out more about this series and to see what's in store for Harry in the next books. :)Rating:\n  \n    \n      \n  \n"},
{"rating": 5, "text": "Obviously 5/5 stars, especially because DANG the illustrations in this are on point. They were breathtaking. I can not recommend this illustrated edition enough. Even if you've read the book a million times, reading this version is like seeing it with new eyes. I absolutely LOVED it. "},
{"rating": 4, "text": " I'm 30 years old and I've finally started the Harry Potter series. I know what you're thinking- it took me long enough! I say better late than never! I remember when the first movie was released in 2001. My sister was reading the books and so was my best friend. In 2001 I was in high school, and though I loved the movie, I was reading Sylvia Plath and Wally Lamb and had no interest in the young adult genre. Now, totally different story! I'm all about reading some YA. Since I've seen the movies,\n  I'm 30 years old and I've finally started the Harry Potter series. I know what you're thinking- it took me long enough! I say better late than never! I remember when the first movie was released in 2001. My sister was reading the books and so was my best friend. In 2001 I was in high school, and though I loved the movie, I was reading Sylvia Plath and Wally Lamb and had no interest in the young adult genre. Now, totally different story! I'm all about reading some YA. Since I've seen the movies, there wasn't a ton of new material in this book for me (though my I've heard that the further I get into the series, the more new material I'll come across). I enjoyed reading this one lots and I'm looking forward to reading the rest of the magical Harry Potter books this year! "},
{"rating": 0, "text": "I have a confession to make. ***I have never read Harry Potter. Yes, yes, I know...this is akin to reader sacrilege.But I just had no interest in these books when they came out. I was too busy reading about men in kilts fucking the milkmaid. Therefore, my only experience with \"Hermione\" is the SNL skit where Lindsey Lohan shows Harry and that other scarfed dude her ginormous tatas. Well, what with everyone going ape shit over the newest installment, I figure I should probably find out what all tI have a confession to make. ***I have never read Harry Potter. Yes, yes, I know...this is akin to reader sacrilege.But I just had no interest in these books when they came out. I was too busy reading about men in kilts fucking the milkmaid. Therefore, my only experience with \"Hermione\" is the SNL skit where Lindsey Lohan shows Harry and that other scarfed dude her ginormous tatas. Well, what with everyone going ape shit over the newest installment, I figure I should probably find out what all this Hogwart's business is about. And since my friend's 9 year old demanded that I read his copy, I now have the paperback in my possession. Hoping to get starting this week..."},
{"rating": 5, "text": "“There are some things you can't share without ending up liking each other, and knocking out a twelve-foot mountain troll is one of them.”Harry Potter is the most amazing series that I have ever read in my whole life, and it probably forever will be. I will never love any books as much as I love these. I don't think I have to tell you guys about how good this book is because most of you have already read it anyway.I haven't written a review so far because I just did not feel the need to put this“There are some things you can't share without ending up liking each other, and knocking out a twelve-foot mountain troll is one of them.”Harry Potter is the most amazing series that I have ever read in my whole life, and it probably forever will be. I will never love any books as much as I love these. I don't think I have to tell you guys about how good this book is because most of you have already read it anyway.I haven't written a review so far because I just did not feel the need to put this obvious opinion into words. I don't think anything I write here hasn't been said already. But I've just read the illustrated edition by Jim Kay and if it is possible, it makes this book even more outstanding than it already is. Jim Kay is awesome. Maybe you have read  A Monster Calls  and already know him. If not, you should definitley reconsider your life choices.I am certainly going to buy an edition of this, it's so pretty I could die. Looking forward to the illustrated sequels!1000/5 stars."},
{"rating": 5, "text": "Harry Potter and the Sorcerer's Stone is one of the most celebrated books of all time for one simple reason...because it deserves to be!I'll write a full review when I have time, but for now here's my...\"Book, you have the right to a speedy trial\" review THE DEFENSE  - Rowling's prose is absolutely magical - Story is not only exciting but often sweet as well - Lead characters are all captivating - Comic relief (mostly from Ron) is blended perfectly with the more dramatic events - Never a dull moHarry Potter and the Sorcerer's Stone is one of the most celebrated books of all time for one simple reason...because it deserves to be!I'll write a full review when I have time, but for now here's my...\"Book, you have the right to a speedy trial\" review\n  THE DEFENSE\n - Rowling's prose is absolutely magical - Story is not only exciting but often sweet as well - Lead characters are all captivating - Comic relief (mostly from Ron) is blended perfectly with the more dramatic events - Never a dull moment\n  THE PROSECUTION\n - Rowling is occasionally too over-the-top for her own good (especially during Harry's time with the Dursleys) - After reading this, anything else you do may seem like a waste of time that you could have used to read Harry Potter again!\n  THE VERDICT\nSome books are worth reading once, this one is worthy reading many times! A brilliant adventure that anyone can enjoy!"},
{"rating": 4, "text": "In the Harry Potter series, J.K. Rowling perfects the most important rule of story telling: be interesting. Her prose might not be great (although it is good), her plots and mysteries might be a little convoluted. But damn can she tell an interesting story, build a fun world, and put great characters in it.From the first sentence, she lets you know what fun you're in for. There's just that magical touch to it only she seems to have. And she keeps it going through the whole book (and the six otheIn the Harry Potter series, J.K. Rowling perfects the most important rule of story telling: be interesting. Her prose might not be great (although it is good), her plots and mysteries might be a little convoluted. But damn can she tell an interesting story, build a fun world, and put great characters in it.From the first sentence, she lets you know what fun you're in for. There's just that magical touch to it only she seems to have. And she keeps it going through the whole book (and the six others in the series) without missing a beat.The Sorcerer's Stone is packed with mystery. It starts early and picks up speed, burning through pages, right to the reveal, which is quite the surprise--no Scooby-Doo ending here.But the thing that really makes this book stand out is the characters. Harry Potter ended up getting on my last nerve in the series, but in this book, he's crazy likable. The minor characters are what really make the series, though. They have more personality than the protagonist of most books.This series might not be the best, but there's nothing like it. It's just magical. Plain and simple."},
{"rating": 3, "text": "EDIT NOTE in 2012: Since this apparently isn't obvious, I wrote the review years ago. I do not necessarily have those opinions now. I wouldn't know; I haven't read Harry Potter since. With a degree and five more birthdays behind me I do not necessarily agree with everything I said when I was seventeen years old. I'm happy to chat about the definition of literature with you, or what I think about the Harry Potter phenomenon now or whatever, but try and be civil and don't attack me right out of thEDIT NOTE in 2012: Since this apparently isn't obvious, I wrote the review years ago. I do not necessarily have those opinions now. I wouldn't know; I haven't read Harry Potter since. With a degree and five more birthdays behind me I do not necessarily agree with everything I said when I was seventeen years old. I'm happy to chat about the definition of literature with you, or what I think about the Harry Potter phenomenon now or whatever, but try and be civil and don't attack me right out of the gate.EDIT NOTE in 2011: I've edited this review to take out some teenage arrogance, but the rest is as-is. A few years later and with a degree in hand, including modules in Children's Lit, I could probably write a better review, but people seem to like this one!I really don't like Harry Potter. It's one of those little concealed but apparently not widely known facts about me, which shocks everyone when I say I love books and they're all, \"yeah, rite, Harry Potter is so awesum rite?\" and I say \"...no, it really isn't.\" I confess: when I was eleven or twelve or so, I read them. I also read the Sabrina the Teenage Witch novels. I read everything and wasn't very discriminating about it. I did enjoy them. I continued to enjoy them until I got to Order of the Phoenix, and then I decided that all the hype aside, I just wasn't interested anymore. Bear in mind, then, for the rest of this \"essay\", that I have only read up to and including The Goblet of Fire.Cue a few years of irritation while everyone insisted I must read the rest of the books, and how dare I prefer Tolkien and Ursula Le Guin (and later, Susan Cooper). I have really no objection to people reading the books and enjoying them, taking part in the fandom that surrounds them, dressing up in witchy costumes to go and pick up the most recently released volume at midnight. Have fun with that! As far as I'm concerned you're welcome to. I'm even quite happy to concede that yes, Harry Potter did get more people reading. Whether it got them reading literature or not is another matter: how many people, I wonder, have discovered a mania for reading after reading Harry Potter and then gone onto the likes of Crime and Punishment and War and Peace, or even Lord of the Rings? Not that many, I'll bet. I think they're probably reading Twilight and the like, more often than not. Not that it matters -- as long as people are reading.But in any case, I. Don't. Have. To. Read. Them. Just because I like books, does not mean I like those books. And I detest it every time someone shoves them in my face as 'great literature'. I actually had to study Harry Potter, for my English Lit/Lang A Level (for those unfamiliar with our system: A Levels are exams you take when you're about eighteen, which among other things determine whether you can go to university). One of the questions we had to figure out how to answer was whether we thought Harry Potter was good literature, whether we thought it would stand the test of time, and how it was suited to the time it's currently in.It was then that I figured out that, yeah, there are things wrong with Harry Potter beyond just the hype that was irritating me so much and the feeling that Rowling in no way matched up to the giants of fantasy and sci-fi, like Tolkien. I studied it alongside Tom Brown's Schooldays, by Thomas Hughes. Do note that I didn't like that book either. But it's a well written, well shaped, well considered book -- and it doesn't use the same cheap tricks as Harry Potter does. I'm not going to say much about that, since it's not a book I liked: if I'm going to compare/contrast, I'll compare with my favourite book that is also supposed to be for younger readers, Susan Cooper's The Dark Is Rising.There's nothing wrong with Harry Potter and the Philosopher's Stone being an amateur first novel. 'cause that's what it is. I'm sure many people's first novels don't even see the light of day, and yet Harry Potter somehow made it to a publisher's and was accepted. The thing is, people mostly refuse to recognise that and the cheap tricks J. K. Rowling uses. For example, her character's names. 'Draco Malfoy'. Mal, the French for bad, immediately obvious. 'Draco', suggesting dragon? Or perhaps 'draconian', which has negative connotations aplenty (not that I'd necessarily attribute those particular ones to Draco). Not very subtle, is it? 'Dumbledore'. Who doesn't get the image of a well-meaning, if strange, old man? 'Minerva', straight out of Greek myth: a goddess of knowledge. Gee, I wonder why Rowling chose that for a female teacher... 'Remus Lupin', 'Sirius Black', 'Mad-Eye Moody'... Do I even have to say anything?And 'Harry Potter'. Nothing striking about that: perfectly ordinary, as names go, right?Yeah. And that's the point. Harry Potter himself is not a real character -- certainly not at first. He's a cypher, a convenient space into which a kid can very easily insert himself or even herself. He's brave. Okay, generic hero characteristic. He has doubts. Again, the same. He has a Tragic Past. Don't we all? Or don't we all like to think we do? Look at the Mary Sues/self inserts people write in fandom -- so often they're people with incredibly dark, melodramatic pasts that they rise above. Harry Potter is a convenient place to insert yourself. The other characters are archetypes more than anything -- Hermione, the know it all girl; Ron, the loyal friend; Dumbledore, the mentor; Malfoy, the rival...All of that is actually what makes Harry Potter a highly readable, enjoyable book, for young people and even adults. It's targeted very precisely toward the readership of today. Maybe that makes J. K. Rowling a better author than I might paint her as, that she can know her audience so well -- there's that view, I'm sure. But it's all very basic, and I tend to look on it as cheap tricks. The whole chapter, in the first book, about the Mirror of Erised -- how sad does it make you feel for Harry? It's sentimental, it's sad -- and it's meant to do that, very obviously. There's a whole chapter written just to enforce the love between the members of Harry Potter's family.Susan Cooper does it in a single paragraph that makes me want to cry every single time I read it, coming after all the build up of guilt and pain in the relationship. \"Bran went to [his father] and put his arm round his waist, and stood close. It was the first gesture of affection between the two that Will had ever seen. And wondering, loving surprise woke in Owen Davies's worn face as he looked down at the boy's white head, and the two stood there, waiting.\"That paragraph does for me what Rowling's whole chapter cannot. It's so effective, actually, because Cooper spends a whole book leading up to it, showing us Owen and Bran's relationship. Rowling shows us Harry's parents, but in an unsubtle way that actually throws me out of it because I think, \"Oh, yeah, this is the chapter in which we're supposed to feel very sorry for Harry.\"There's also a very easy, blunt misdirection. You're supposed to hate Snape, supposed to believe he's the one to blame for everything, and at the end, you're supposed to be as surprised as Harry when it's Quirrel waiting there for him. At the age of eleven, I think I went right along with that, but when I reread it for A Level, I had to wince at how heavy-handed the misdirection was. I understand that later in the series Snape comes into it more, and I don't know whether the misdirection turns out to be not that misdirected when it comes down to the real truth: but in the first book, you're meant to believe it's Snape all along, and I don't think J. K. Rowling does a very good job of giving us clues that it's not actually Snape, because she's so busy blackening him to lead people astray.It's also very black-and-white. Questions aren't raised, by this story -- and that's a thing I think is actually important in literature. Raise questions, discuss issues, end with a question. I don't know what to call stories that don't fit into that, really. I'm going to go with 'novels' as opposed to literature. Harry Potter is a novel. It's a story. I don't think it has any real lasting values. Susan Cooper's books, while also quite basic, discussing the Light and the Dark, do end with a question. If man is left on earth, to do as man will, will man be Light or Dark? The immortals leave earth, and say that the world -- for better or worse -- belongs to humans. Right now, a lot of people think the answer to that question would be 'worse'. But Harry Potter does not raise this question, does not raise any question, and does not answer one either. That's why I don't think it will last except perhaps as a phenomenon to be studied: the 'Potter mania' and what caused it.That's why I don't like Rowling's writing. It's not particularly refined, it's unsubtle -- and that's okay, you know, I'm not saying you can't enjoy that, can't find it refreshing. I don't. I'm also not saying that 'novels' are bad -- they're good, they can provide valuable escapism, they can be incredibly rich fodder for the imagination, and I suspect Harry Potter is, for many children. But I don't call it literature, and I myself don't like it.Note: the three star rating is because honestly, when I first read it, I did love it."}
]